# gateway-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 0s [id=8749e4211ca99cade9b076b813b5cf495bc60174]
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Read complete after 0s [id=production_organization_api_endpoint]
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Read complete after 0s [id=production_identity_api_endpoint]
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Read complete after 0s [id=production_customer_api_endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default will be created
  + resource "aws_apigatewayv2_api" "default" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "production_gateway_api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all                     = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_methods     = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 0
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default will be created
  + resource "aws_apigatewayv2_integration" "default" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any will be created
  + resource "aws_apigatewayv2_route" "any" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /"
      + target             = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all      = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gateway/production_gateway_api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all          = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_lambda_permission.default will be created
  + resource "aws_lambda_permission" "default" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "production_gateway_api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "production_gateway_api_endpoint"
      + tags           = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all       = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/production_gateway_api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-production_gateway_api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-production_gateway_api"
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./artifact/lambda.zip"
      + function_name                  = "production_gateway_api"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "7uogEv/XjfY6pqRqOBRrdTMx8Ov7aLVWG9SITKfUvoQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_GRAPHQL_API"     = (sensitive value)
              + "IDENTITY_GRAPHQL_API"     = (sensitive value)
              + "ORGANIZATION_GRAPHQL_API" = (sensitive value)
            }
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*